<a href="https://colab.research.google.com/github/zacksnyder-lsds/Unit_1_build_week/blob/master/Unit_1_build_week.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Reading in the data and initial cleaning

In [0]:
#Imports for the data reading and initial cleaning section 
import pandas as pd

In [0]:
#reading in the datasets I split in a seperate notebook so I could upload to github 
url1 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva1%20(1).csv'
url2 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva2.csv'
url3 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva3.csv'
url4 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva4.csv'
url5 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva5.csv'
url6 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva6.csv'
url7 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva7.csv'
url8 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva8.csv'
url9 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva9.csv'
url10 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva10.csv'

In [0]:
#converting the csv files back to dataframes for use 
kiva1 = pd.read_csv(url1)
kiva2 = pd.read_csv(url2)
kiva3 = pd.read_csv(url3)
kiva4 = pd.read_csv(url4)
kiva5 = pd.read_csv(url5)
kiva6 = pd.read_csv(url6)
kiva7 = pd.read_csv(url7)
kiva8 = pd.read_csv(url8)
kiva9 = pd.read_csv(url9)
kiva10 = pd.read_csv(url10)

In [0]:
#checking to make sure all the data read in smoothly 
[print(name.shape) for name in [kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10]]
kiva2.head()

(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67125, 21)

   Unnamed: 0       id  ...  repayment_interval        date
0       67120  1081611  ...           irregular  2014-06-03
1       67121   719419  ...           irregular  2014-06-03
2       67122   719437  ...           irregular  2014-06-03
3       67123   719717  ...             monthly  2014-06-03
4       67124   719548  ...             monthly  2014-06-03

[5 rows x 21 columns]

In [0]:
#concatinating the dataframes back together to the original from Kaggle 
kiva = pd.concat([kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10])
kiva.reset_index()
print(kiva.shape)
kiva.sample(5)

(671205, 21)

       Unnamed: 0       id  ...  repayment_interval        date
814        135054   785468  ...           irregular  2014-10-19
26238       26238   678946  ...           irregular  2014-03-04
38060      373660  1020835  ...              bullet  2016-02-10
22272      492112  1152233  ...             monthly  2016-09-17
47267      315747   962865  ...              bullet  2015-10-14

[5 rows x 21 columns]

In [0]:
#getting rid of the previous index column renamed unanamed 0 
kiva.drop('Unnamed: 0', axis=1, inplace=True)
kiva.sample(5)

            id  funded_amount  ...  repayment_interval        date
15729  1064616         1375.0  ...             monthly  2016-05-05
7229    922346         1200.0  ...             monthly  2015-07-24
66180  1335850            0.0  ...           irregular  2017-07-07
11164   663904         1050.0  ...             monthly  2014-01-30
16242   800374          325.0  ...           irregular  2014-11-18

[5 rows x 20 columns]